Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd

data = [4, 8, 15, 16, 23, 42]
series = pd.Series(data)

print(series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [2]:
import pandas as pd

my_list = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
series = pd.Series(my_list)

print(series)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

dataframe are the multipul datatype present in the pandas libray.tubes type are the know as the dataframe .
here is how a csv file can be read using pandas

In [4]:
import pandas as pd

my_list = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
series = pd.Series(my_list)

print(series)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

In [5]:
import pandas as pd

df = pd.read_csv('Orders.csv')
print(df.head())

  Order ID  Order Date CustomerName           State     City
0  B-26055  10-03-2018    Harivansh   Uttar Pradesh  Mathura
1  B-25993  03-02-2018       Madhav           Delhi    Delhi
2  B-25973  24-01-2018  Madan Mohan   Uttar Pradesh  Mathura
3  B-25923  27-12-2018        Gopal     Maharashtra   Mumbai
4  B-25757  21-08-2018     Vishakha  Madhya Pradesh   Indore

In [6]:
import pandas as pd

df = pd.read_csv('Orders.csv')
print(df.shape)

(500, 5)

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

In pandas, a DataFrame is mutable, meaning it can be modified after it is created. You can change, update, add, or delete columns and rows within a DataFrame. DataFrame provides methods and functions that allow you to manipulate the data and structure of the DataFrame.

On the other hand, both Series and Panel are considered immutable in pandas. Once a Series or Panel object is created, its data and structure cannot be modified directly. Instead, you can create a new Series or Panel object based on the existing one with modifications if needed.

It's important to note that starting from pandas version 1.0, the Panel data structure has been deprecated, and it is recommended to use other pandas data structures like DataFrame or MultiIndex DataFrame for similar use case

6.Create a DataFrame using multiple Series. Explain with an example.

In [8]:
import pandas as pd

df = pd.read_csv("Orders.csv")

In [10]:
df.columns

Index(['Order ID', 'Order Date', 'CustomerName', 'State', 'City'], dtype='object')

In [12]:
df[[ 'City','CustomerName' ]]

        City CustomerName
0    Mathura    Harivansh
1      Delhi       Madhav
2    Mathura  Madan Mohan
3     Mumbai        Gopal
4     Indore     Vishakha
..       ...          ...
495      Goa       Ashwin
496  Gangtok       Bhavna
497   Mumbai      Shivani
498    Simla      Shubham
499   Jaipur      Monisha

[500 rows x 2 columns]